snlkuharlocal/src/Documents/ВводОстатковВзаиморасчетов/ВводОстатковВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковВзаиморасчетов</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Взаиморасчеты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <comment>Сумма в валюте договора</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <comment>Сумма в валюте упр. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрытогоПериода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/ВводОстатковВзаиморасчетов/ObjectModule.bsl
//Катаев+ 08/08/14
Перем НеКонтролироватьЗапись;
//Катаев- 08/08/14

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Катаев+ 08/08/14 Добавил проверку на атвоматическое создание документа на основании "Передача контрагента
	//Если НЕ ОбменДанными.Загрузка Тогда
	Если НЕ ОбменДанными.Загрузка и Не НеКонтролироватьЗапись Тогда
		//Катаев- 08/08/14
		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	СуммаДокумента=Взаиморасчеты.Итог("СуммаУпр");	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Если ВводОстатков Тогда Возврат КонецЕсли; 
	
	Для Каждого СтрокаТЧ Из Взаиморасчеты Цикл
		Движение=Движения.Взаиморасчеты.Добавить();	
		
		Движение.Период			=Дата;
		
			Если Не ПустаяСтрока(СтрокаТЧ.ДокументЗакрытогоПериода) И СтрокаТЧ.ДатаНачалаЗадолженности = Дата(1,1,1) Тогда
			дд = Число(Лев(Прав(СтрокаТЧ.ДокументЗакрытогоПериода,19),2));
			мм = Число(Лев(Прав(СтрокаТЧ.ДокументЗакрытогоПериода,16),2));
			гг = Число(Лев(Прав(СтрокаТЧ.ДокументЗакрытогоПериода,13),4));
			чч = Число(Лев(Прав(СтрокаТЧ.ДокументЗакрытогоПериода,8),2));
			мн = Число(Лев(Прав(СтрокаТЧ.ДокументЗакрытогоПериода,5),2));
			ск = Число(Прав(СтрокаТЧ.ДокументЗакрытогоПериода,2));
			попытка
				ТекДата=Дата(гг, мм, дд, чч, мн, ск);
			Исключение
				дд=число(сред(СтрокаТЧ.ДокументЗакрытогоПериода,19,2));
				мм=число(сред(СтрокаТЧ.ДокументЗакрытогоПериода,22,2));
				гг=число(сред(СтрокаТЧ.ДокументЗакрытогоПериода,25,4));
				чч=число(сред(СтрокаТЧ.ДокументЗакрытогоПериода,29,2));
				мн=число(сред(СтрокаТЧ.ДокументЗакрытогоПериода,32,2));
				ск=число(сред(СтрокаТЧ.ДокументЗакрытогоПериода,35,2));
				ТекДата=Дата(гг, мм, дд, чч, мн, ск);
			КонецПопытки;
			Движение.Дата_НачалаЗадолженности = ТекДата;
		КонецЕсли;
		
		Движение.Контрагент		=СтрокаТЧ.Контрагент;
		Движение.Договор		=СтрокаТЧ.Договор;
		
		Если СтрокаТЧ.СуммаУпр>0 Тогда
			Движение.СуммаУпр		=СтрокаТЧ.СуммаУпр;
			Движение.СуммаВал		=СтрокаТЧ.СуммаВал;				
			
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
		Иначе
			Движение.СуммаУпр		=-СтрокаТЧ.СуммаУпр;
			Движение.СуммаВал		=-СтрокаТЧ.СуммаВал;				
			
			Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;		
		КонецЕсли;		
		Движение.Дата_НачалаЗадолженности = СтрокаТЧ.ДатаНачалаЗадолженности;
		Движение.Документ_ЗакрытогоПериода = СтрокаТЧ.ДокументЗакрытогоПериода;
	КонецЦикла; 
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

Процедура ЗаписатьБезПроверки(РежимПроведения) Экспорт
	НеКонтролироватьЗапись = Истина;
	ЭтотОбъект.Записать(РежимПроведения);
	НеКонтролироватьЗапись = Ложь;
КонецПроцедуры

НеКонтролироватьЗапись = Ложь;
